//도전 1
#include<stdio.h>
/*  00 01 02 03     01 02 03 04
    10 11 12 13     05 06 07 08
    20 21 22 23     09 10 11 12
    30 31 32 33     13 14 15 16 */

/*  30 20 10 00     13 09 05 01
    31 21 11 01     14 10 06 02
    32 22 12 02     15 11 07 03
    33 23 13 03     16 12 08 04 */

/*  33 32 31 30     16 15 14 13
    23 22 21 20     12 11 10 09
    13 12 11 10     08 07 06 05
    03 02 01 00     04 03 02 01 */

/*  03 13 23 33     04 08 12 16
    02 12 22 32     03 07 11 15
    01 11 21 31     02 06 10 14
    00 10 20 30     01 05 09 13 */

void Rotate(int(*arr)[4], int repeat)
{
    int alter[4][4] = {0};
    
    for(int z = 0; z<repeat; z++)
    {
        for(int i = 0; i<4;i++)
            for(int j = 0; j<4; j++)
                alter[i][j] = arr[i][j];

        for(int i = 0; i<4; i++)
            for(int j = 0; j<4; j++)
                arr[j][3-i] = alter[i][j];  // 위치 변경
        
        for(int i = 0; i<4; i++)
        {
            for(int j = 0; j<4; j++)
                printf("%d ", arr[i][j]);  // 4x4 배열 출력
            printf("\n");    
        }
        printf("\n");
    }
}
int main() 
{
    int arr[][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16};
    
    Rotate(arr,3);  // 회전 3회 진행
    
    return 0;
}